Documents/ВебЗаказПокупателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ВебЗаказПокупателя</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресДоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОплаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИОПокупателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Email</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусМагазина</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыМагазинаДляВебЗаказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПередачиВМагазин</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерБонуснойКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресДоставкиДополнительно</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяИнформация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Масса</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/CMS1C_ДополнительныеРеквизитыЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>CMS1C_ДополнительныеРеквизитыЗаказа</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ID</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкаСайта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CMS1C_НастройкиСайтов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипОплаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВебЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ВыкладкаПланограммы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ВыкладкаПланограммы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МестоВыкладки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаВыкладки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТоварВыведен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Планограмма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Планограммы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыМагазинаДляВебЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>СтатусыМагазинаДляВебЗаказов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Распечатан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Собран</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ВебЗаказПокупателя/Ext/ManagerModule.bsl
//
//
Функция ПечатьЗаказНаДоставку(Ссылка) Экспорт
	
	//
	УстановитьПривилегированныйРежим(Истина);
	
	//
	ТабличныйДокумент = Новый ТабличныйДокумент();
	
	//
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Планограмма", ПараметрыСеанса.ТорговаяТочкаПоАйпи.Планограмма);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВебЗаказПокупателяТовары.Ссылка КАК Ссылка,
	               |	ВЫБОР
	               |		КОГДА ВебЗаказПокупателяТовары.Ссылка.ДатаПередачиВМагазин <> ДАТАВРЕМЯ(1, 1, 1)
	               |			ТОГДА ВебЗаказПокупателяТовары.Ссылка.ДатаПередачиВМагазин
	               |		ИНАЧЕ ВебЗаказПокупателяТовары.Ссылка.Дата
	               |	КОНЕЦ КАК Дата,
	               |	CMS1C_ДополнительныеРеквизитыЗаказа.Номер КАК Номер,
	               |	ВЗ_Запрос.МестоВыкладки КАК МестоВыкладки,
	               |	ВебЗаказПокупателяТовары.Номенклатура КАК Номенклатура,
	               |	СУММА(ВебЗаказПокупателяТовары.Количество) КАК Количество,
	               |	ВебЗаказПокупателяТовары.Ссылка.СтатусМагазина КАК Статус,
	               |	ВЫРАЗИТЬ(ВебЗаказПокупателяТовары.Номенклатура.МассаУпаковки КАК СТРОКА(100)) КАК ОписаниеУпаковки,
	               |	ВЫБОР
	               |		КОГДА ВебЗаказПокупателяТовары.Номенклатура.ОднаУпаковкаСодержит = 0
	               |			ТОГДА ВебЗаказПокупателяТовары.Номенклатура.ЕдиницаХраненияОстатков.Вес
	               |		ИНАЧЕ ВебЗаказПокупателяТовары.Номенклатура.ОднаУпаковкаСодержит
	               |	КОНЕЦ КАК Вес,
	               |	ВебЗаказПокупателяТовары.Цена,
	               |	СУММА(ВебЗаказПокупателяТовары.Сумма) КАК Сумма,
	               |	ВебЗаказПокупателяТовары.Комментарий,
	               |	ВЫРАЗИТЬ(ВебЗаказПокупателяТовары.Ссылка.АдресДоставкиДополнительно КАК СТРОКА(250)) КАК АдресДоставкиДополнительно,
	               |	ВЫРАЗИТЬ(ВебЗаказПокупателяТовары.Ссылка.ДополнительнаяИнформация КАК СТРОКА(250)) КАК ДополнительнаяИнформация
	               |ИЗ
	               |	Документ.ВебЗаказПокупателя.Товары КАК ВебЗаказПокупателяТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CMS1C_ДополнительныеРеквизитыЗаказа КАК CMS1C_ДополнительныеРеквизитыЗаказа
	               |		ПО ВебЗаказПокупателяТовары.Ссылка = CMS1C_ДополнительныеРеквизитыЗаказа.Заказ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ВыкладкаПланограммы.МестоВыкладки КАК МестоВыкладки,
	               |			ВыкладкаПланограммы.Номенклатура КАК Ссылка
	               |		ИЗ
	               |			РегистрСведений.ВыкладкаПланограммы КАК ВыкладкаПланограммы
	               |		ГДЕ
	               |			ВыкладкаПланограммы.Планограмма = &Планограмма) КАК ВЗ_Запрос
	               |		ПО ВебЗаказПокупателяТовары.Номенклатура = ВЗ_Запрос.Ссылка
	               |ГДЕ
	               |	ВебЗаказПокупателяТовары.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВЗ_Запрос.МестоВыкладки,
	               |	ВебЗаказПокупателяТовары.Номенклатура,
	               |	ВебЗаказПокупателяТовары.Ссылка,
	               |	CMS1C_ДополнительныеРеквизитыЗаказа.Номер,
	               |	ВЫРАЗИТЬ(ВебЗаказПокупателяТовары.Номенклатура.МассаУпаковки КАК СТРОКА(100)),
	               |	ВебЗаказПокупателяТовары.Ссылка.СтатусМагазина,
	               |	ВебЗаказПокупателяТовары.Цена,
	               |	ВебЗаказПокупателяТовары.Масса,
	               |	ВебЗаказПокупателяТовары.Комментарий,
	               |	ЕСТЬNULL(ВебЗаказПокупателяТовары.Ссылка.ДатаПередачиВМагазин, ВебЗаказПокупателяТовары.Ссылка.Дата),
	               |	ВЫБОР
	               |		КОГДА ВебЗаказПокупателяТовары.Ссылка.ДатаПередачиВМагазин <> ДАТАВРЕМЯ(1, 1, 1)
	               |			ТОГДА ВебЗаказПокупателяТовары.Ссылка.ДатаПередачиВМагазин
	               |		ИНАЧЕ ВебЗаказПокупателяТовары.Ссылка.Дата
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ВебЗаказПокупателяТовары.Номенклатура.ОднаУпаковкаСодержит = 0
	               |			ТОГДА ВебЗаказПокупателяТовары.Номенклатура.ЕдиницаХраненияОстатков.Вес
	               |		ИНАЧЕ ВебЗаказПокупателяТовары.Номенклатура.ОднаУпаковкаСодержит
	               |	КОНЕЦ,
	               |	ВЫРАЗИТЬ(ВебЗаказПокупателяТовары.Ссылка.АдресДоставкиДополнительно КАК СТРОКА(250)),
	               |	ВЫРАЗИТЬ(ВебЗаказПокупателяТовары.Ссылка.ДополнительнаяИнформация КАК СТРОКА(250)),
	               |	ВЫРАЗИТЬ(ВебЗаказПокупателяТовары.Ссылка.АдресДоставкиДополнительно КАК СТРОКА(250)),
	               |	ВЫРАЗИТЬ(ВебЗаказПокупателяТовары.Ссылка.ДополнительнаяИнформация КАК СТРОКА(250))
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВЗ_Запрос.МестоВыкладки.Наименование,
	               |	ВебЗаказПокупателяТовары.Номенклатура.Наименование
	               |ИТОГИ
	               |	МАКСИМУМ(Дата),
	               |	МАКСИМУМ(Номер)
	               |ПО
	               |	Ссылка,
	               |	МестоВыкладки";
				   
	//				   
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	//
	СуммаПокупки = 0;
	
	//
	Пока Выборка.Следующий() Цикл
		
		//
		Макет = Документы.ВебЗаказПокупателя.ПолучитьМакет("ЗаказНаДоставку");
		
		//
		Область = Макет.ПолучитьОбласть("Шапка");
	
		//
		Номер = Выборка.Номер;//ОбщегоНазначения.ПолучитьНомерНаПечать(Выборка.Ссылка);
		Дата = Выборка.Дата;
		
		//
		Область.Параметры.Номер = Номер;
		Область.Параметры.Дата = Формат(Дата, "ДФ=dd.MM.yyyy");
		
		//
		ТабличныйДокумент.Вывести(Область);
		
		//
		Область = Макет.ПолучитьОбласть("ШапкаПокупатель");
		
		//
		Область.Параметры.ПокупательФИО = Ссылка.ФИОПокупателя;
		Область.Параметры.НомерКарты = Ссылка.НомерБонуснойКарты;
		Область.Параметры.ПокупательEmail = Ссылка.Email;
		Область.Параметры.ПокупательТелефон = Ссылка.Телефон;
		
		//
		Область.Параметры.ДополнительнаяИнформация = Ссылка.ДополнительнаяИнформация; 
		
		
		//
		ТабличныйДокумент.Вывести(Область);
		
		//
		Если Ссылка.Услуги.Количество() > 0 Тогда
			
			//
			Область = Макет.ПолучитьОбласть("ШапкаДоставка");
			
			//
			Тариф = Ссылка.Услуги[0].Номенклатура;
			Если ЗначениеЗаполнено(Тариф) Тогда
				
				//
				Область.Параметры.ДоставкаТариф = Тариф;
				Область.Параметры.ДоставкаАдрес = Ссылка.АдресДоставки;
				
				//
				Область.Параметры.АдресДоставкиДополнительно = Ссылка.АдресДоставкиДополнительно;
				
				//
				ТабличныйДокумент.Вывести(Область);
			
			КонецЕсли; 
			
		КонецЕсли; 
		
		//
		Область = Макет.ПолучитьОбласть("ТаблицаШапка");
		ТабличныйДокумент.Вывести(Область);
		
		//
		ВыборкаПланограмма = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПланограмма.Следующий() Цикл
			
			//
			Область = Макет.ПолучитьОбласть("МестоВыкладки");
			Область.Параметры.МестоВыкладки = ВыборкаПланограмма.МестоВыкладки;
			
			//
			ТабличныйДокумент.Вывести(Область);	
				
			//
			ВыборкаНоменклатура = ВыборкаПланограмма.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаНоменклатура.Следующий() Цикл
				
				//
				Область = Макет.ПолучитьОбласть("Строка");
				Область.Параметры.Заполнить(ВыборкаНоменклатура);
				
				//
				ТабличныйДокумент.Вывести(Область);	
				
				////
				//Если ЗначениеЗаполнено(ВыборкаНоменклатура.Комментарий) Тогда
				//	
				//	//
				//	Область = Макет.ПолучитьОбласть("Комментарий");
				//	Область.Параметры.Комментарий = ВыборкаНоменклатура.Комментарий;
				//	
				//	//
				//	ТабличныйДокумент.Вывести(Область);
				//
				//КонецЕсли; 
			
			КонецЦикла; 
		
		КонецЦикла; 
	
	КонецЦикла; 
	
	//
	Область = Макет.ПолучитьОбласть("Подвал");
	
	//
	Область.Параметры.ИтогоСуммаПокупки = Ссылка.Товары.Итог("Сумма");
	Область.Параметры.СуммаДоставки = Ссылка.Услуги.Итог("Сумма");
	Область.Параметры.ИтогоКоплате = Ссылка.СуммаДокумента;	
	
	//
	ТабличныйДокумент.Вывести(Область);	
	
	//			   
	ДокОбъект = Ссылка.ПолучитьОбъект();
	ДокОбъект.СтатусМагазина = Перечисления.СтатусыМагазинаДляВебЗаказов.Распечатан;
	ДокОбъект.Записать();
	
	//
	Возврат ТабличныйДокумент;
	
КонецФункции	



Функция ПолучитьЗаказНаДоставку(Ссылка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Планограмма", ПараметрыСеанса.ТорговаяТочкаПоАйпи.Планограмма);
	Запрос.Текст = "ВЫБРАТЬ
	               |	CMS1C_ДополнительныеРеквизитыЗаказа.Номер
	               |ИЗ
	               |	РегистрСведений.CMS1C_ДополнительныеРеквизитыЗаказа КАК CMS1C_ДополнительныеРеквизитыЗаказа
	               |ГДЕ
	               |	CMS1C_ДополнительныеРеквизитыЗаказа.Заказ = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВЗ_Запрос.МестоВыкладки КАК МестоВыкладки,
	               |	ВебЗаказПокупателяТовары.Номенклатура,
	               |	СУММА(ВебЗаказПокупателяТовары.Количество) КАК Количество
	               |ИЗ
	               |	Документ.ВебЗаказПокупателя.Товары КАК ВебЗаказПокупателяТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ВыкладкаПланограммы.МестоВыкладки КАК МестоВыкладки,
	               |			ВыкладкаПланограммы.Номенклатура КАК Ссылка
	               |		ИЗ
	               |			РегистрСведений.ВыкладкаПланограммы КАК ВыкладкаПланограммы
	               |		ГДЕ
	               |			ВыкладкаПланограммы.Планограмма = &Планограмма) КАК ВЗ_Запрос
	               |		ПО ВебЗаказПокупателяТовары.Номенклатура = ВЗ_Запрос.Ссылка
	               |ГДЕ
	               |	ВебЗаказПокупателяТовары.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВЗ_Запрос.МестоВыкладки,
	               |	ВебЗаказПокупателяТовары.Номенклатура
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВЗ_Запрос.МестоВыкладки.Наименование,
	               |	ВебЗаказПокупателяТовары.Номенклатура.Наименование";
				   
	Результаты = Запрос.ВыполнитьПакет();
	Выборка = Результаты[0].Выбрать();
	
	ТабличныйДокумент = Новый ТабличныйДокумент();
	
	Макет = Документы.ВебЗаказПокупателя.ПолучитьМакет("Макет");
	Область = Макет.ПолучитьОбласть("Шапка");
	Если Выборка.Следующий() Тогда
		Область.Параметры.Номер = Выборка.Номер;
	Иначе
		Область.Параметры.Номер = Ссылка.Номер;
	КонецЕсли;	
	Область.Параметры.Дата = Формат(Ссылка.Дата, "ДФ=dd.MM.yyyy");
	ТабличныйДокумент.Вывести(Область);
	
				   
	Выборка = Результаты[1].Выбрать();
	Пока Выборка.СледующийПоЗначениюПоля("МестоВыкладки") Цикл
		Область = Макет.ПолучитьОбласть("МестоВыкладки");
		Область.Параметры.МестоВыкладки = Выборка.МестоВыкладки;
		ТабличныйДокумент.Вывести(Область);
		Пока Выборка.Следующий() Цикл
			Область = Макет.ПолучитьОбласть("Строка");
			Область.Параметры.Номенклатура = Выборка.Номенклатура;
			Область.Параметры.Количество = Выборка.Количество;
			ТабличныйДокумент.Вывести(Область);
		КонецЦикла;	
	КонецЦикла;	
				   
	ДокОбъект = Ссылка.ПолучитьОбъект();
	ДокОбъект.СтатусМагазина = Перечисления.СтатусыМагазинаДляВебЗаказов.Распечатан;
	ДокОбъект.Записать();
	
	Возврат ТабличныйДокумент;
	
КонецФункции
